Revit 2027 API
ViewDisplayModel.SilhouetteEdgesGStyleId Property
 Style ID for silhouette edges
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId SilhouetteEdgesGStyleId { get; set; }
Public Property SilhouetteEdgesGStyleId As ElementId
	Get
	Set
public:
property ElementId^ SilhouetteEdgesGStyleId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member SilhouetteEdgesGStyleId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ViewDisplayModel Class
Autodesk.Revit.DB Namespace